Revit 2024 API
ScheduleFilter Members
The ScheduleFilter type exposes the following members.
Constructors
Name | Description
ScheduleFilter()
 Creates a new ScheduleFilter.
ScheduleFilter(ScheduleFieldId, ScheduleFilterType)
 Creates a new ScheduleFilter.
ScheduleFilter(ScheduleFieldId, ScheduleFilterType, ElementId)
 Creates a new ScheduleFilter.
ScheduleFilter(ScheduleFieldId, ScheduleFilterType, Double)
 Creates a new ScheduleFilter.
ScheduleFilter(ScheduleFieldId, ScheduleFilterType, Int32)
 Creates a new ScheduleFilter.
ScheduleFilter(ScheduleFieldId, ScheduleFilterType, String)
 Creates a new ScheduleFilter.
Methods
Name | Description
Dispose
Releases all resources used by the ScheduleFilter
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetDoubleValue
 Gets the filter value for a filter using a double value.
GetElementIdValue
 Gets the filter value for a filter using an ElementId value.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetIntegerValue
 Gets the filter value for a filter using an integer value.
GetStringValue
 Gets the filter value for a filter using a string value.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SetNullValue
 Sets the filter to have no specified value (used for HasParameter filters).
SetValue(Double)
 Set the filter value to a double.
SetValue(Int32)
 Set the filter value to an integer.
SetValue(String)
 Set the filter value to a string.
SetValue(ElementId)
 Set the filter value to an ElementId.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
FieldId
 The ID of the field used to filter the schedule.
FilterType
 The filter type.
IsDoubleValue
 Indicates if the filter has a double value.
IsElementIdValue
 Indicates if the filter has an ElementId value.
IsIntegerValue
 Indicates if the filter has an integer value.
IsNullValue
 Indicates if the filter has no specified value.
IsStringValue
 Indicates if the filter has a string value.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ScheduleFilter Class
Autodesk.Revit.DB Namespace